# Case Study 09-01-2021 (2nd attempt)

In [1]:
import pandas as pd
pd.options.display.max_rows = 50

## Data Understanding

In [2]:
!ls

Case Study - Data Analytics - 2021.xlsx Case_Study_09012021_2nd_Attempt.pdf
Case_Study_09012021_2nd_Attempt.ipynb

In [3]:
# Sales - Total
df1 = pd.read_excel('Case Study - Data Analytics - 2021.xlsx', sheet_name=1)
display(df1.shape)
display(df1.info())
display(df1.head())

(6721, 4)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6721 entries, 0 to 6720
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Dealer       6721 non-null   object
 1   Year         6721 non-null   int64
 2   Month        6721 non-null   int64
 3   Total Sales  6721 non-null   int64
dtypes: int64(3), object(1)
memory usage: 210.2+ KB

None

   Dealer  Year  Month  Total Sales
0  CC0056  2019     10           65
1  BB0184  2019     11           80
2  AB0002  2019     11          127
3  CC0064  2019     12          162
4  MA0143  2019     11          170

In [4]:
df1['Year'].unique()

array([2019])

In [5]:
# Sales - Conq
df2 = pd.read_excel('Case Study - Data Analytics - 2021.xlsx', sheet_name=2)
display(df2.shape)
display(df2.info())
display(df2.head())

(1565, 5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1565 entries, 0 to 1564
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Dealer          1565 non-null   object
 1   Month           1565 non-null   int64
 2   Year            1565 non-null   int64
 3   Year Month      1565 non-null   int64
 4   Conquest Sales  1565 non-null   int64
dtypes: int64(4), object(1)
memory usage: 61.3+ KB

None

   Dealer  Month  Year  Year Month  Conquest Sales
0  TA0190     11  2019       43770              37
1  TA0214     12  2019       43800              34
2  TA0214     11  2019       43770              32
3  TA0168     12  2019       43800              31
4  CB0122     12  2019       43800              28

In [6]:
df2['Year'].unique()

array([2019])

In [7]:
# Sales - Loyal
df3 = pd.read_excel('Case Study - Data Analytics - 2021.xlsx', sheet_name=3)
display(df3.shape)
display(df3.info())
display(df3.head())

(12441, 6)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12441 entries, 0 to 12440
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Dealer                   12441 non-null  object
 1   Month                    12441 non-null  int64
 2   Year                     12441 non-null  int64
 3   Year Month               12441 non-null  datetime64[ns]
 4   TransactionType          12441 non-null  object
 5   Loyalty & Service Sales  12441 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 583.3+ KB

None

   Dealer  Month  Year Year Month TransactionType  Loyalty & Service Sales
0  TA0131     12  2019 2019-12-01     aM Campaign                      173
1  TA0131     10  2019 2019-10-01     aM Campaign                      145
2  TA0131     11  2019 2019-11-01     aM Campaign                      134
3  CB0080     10  2019 2019-10-01     aM Campaign                      127
4  TA0169     10  2019 2019-10-01     aM Campaign                      126

In [8]:
df3['Year'].unique()

array([2019])

In [9]:
# Email Volume
df4 = pd.read_excel('Case Study - Data Analytics - 2021.xlsx', sheet_name=4)
display(df4.shape)
display(df4.info())
display(df4.head())

(4863, 6)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4863 entries, 0 to 4862
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Email_month      4863 non-null   object
 1   Email_Year Full  4863 non-null   int64
 2   Dealer           4863 non-null   object
 3   Sent             4863 non-null   int64
 4   Delivered        4863 non-null   int64
 5   Delivery %       4863 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 228.1+ KB

None

  Email_month  Email_Year Full  Dealer   Sent  Delivered  Delivery %
0     October             2019  TA0131  26819      26210    0.977292
1    November             2019  TA0131  27324      25882    0.947226
2    December             2019  TA0131  26815      24118    0.899422
3    November             2019  TA0192  23607      21494    0.910493
4    November             2019  TA0220  20060      18882    0.941276

In [10]:
df4['Email_Year Full'].unique()

array([2019])

In [11]:
df4['Email_month'].unique()

array(['October', 'November', 'December'], dtype=object)

In [12]:
# Change "Email_month" from words to numbers
month = []
for m in df4['Email_month']:
    if m == "October":
        month.append(10)
    elif m == "November":
        month.append(11)
    else:
        month.append(12)
df4['Email_month'] = month

df4.head()

   Email_month  Email_Year Full  Dealer   Sent  Delivered  Delivery %
0           10             2019  TA0131  26819      26210    0.977292
1           11             2019  TA0131  27324      25882    0.947226
2           12             2019  TA0131  26815      24118    0.899422
3           11             2019  TA0192  23607      21494    0.910493
4           11             2019  TA0220  20060      18882    0.941276

## Q1 - Aggregate results for dealer IDs TA0131, MA0143, and CB0122 into a single worksheet of pivot-friendly/Tableau-friendly data.

### Aggregate results for TA0131

In [13]:
TA0131_1 = df1.loc[df1['Dealer'] == 'TA0131'].sort_values(by='Month', ascending=False)
TA0131_1.set_index('Dealer', inplace=True)
display(TA0131_1)

TA0131_2 = df2.loc[df2['Dealer'] == 'TA0131'].sort_values(by='Month', ascending=False)
TA0131_2.set_index('Dealer', inplace=True)
display(TA0131_2)

TA0131_3 = df3.loc[df3['Dealer'] == 'TA0131'].sort_values(by='Month', ascending=False)
TA0131_3.set_index('Dealer', inplace=True)
display(TA0131_3)

TA0131_4 = df4.loc[df4['Dealer'] == 'TA0131'].sort_values(by='Email_month', ascending=False)
TA0131_4.set_index('Dealer', inplace=True)
display(TA0131_4)

        Year  Month  Total Sales
Dealer
TA0131  2019     12          982
TA0131  2019     11          769
TA0131  2019     10          822

        Month  Year  Year Month  Conquest Sales
Dealer
TA0131     12  2019       43800              24
TA0131     11  2019       43770              17
TA0131     10  2019       43739              18

        Month  Year Year Month TransactionType  Loyalty & Service Sales
Dealer
TA0131     12  2019 2019-12-01     aM Campaign                      173
TA0131     12  2019 2019-12-01       aM Direct                       11
TA0131     12  2019 2019-12-01       sM Direct                        7
TA0131     12  2019 2019-12-01     sM Campaign                        4
TA0131     11  2019 2019-11-01     aM Campaign                      134
TA0131     11  2019 2019-11-01       aM Direct                       12
TA0131     11  2019 2019-11-01       sM Direct                        8
TA0131     11  2019 2019-11-01     sM Campaign                        7
TA0131     10  2019 2019-10-01     aM Campaign                      145
TA0131     10  2019 2019-10-01     sM Campaign                       12
TA0131     10  2019 2019-10-01       aM Direct                       12
TA0131     10  2019 2019-10-01       sM Direct                        1

        Email_month  Email_Year Full   Sent  Delivered  Delivery %
Dealer
TA0131           12             2019  26815      24118    0.899422
TA0131           11             2019  27324      25882    0.947226
TA0131           10             2019  26819      26210    0.977292

### Aggregate results for MA0143

In [14]:
MA0143_1 = df1.loc[df1['Dealer'] == 'MA0143'].sort_values(by='Month', ascending=False)
MA0143_1.set_index('Dealer', inplace=True)
display(MA0143_1)

MA0143_2 = df2.loc[df2['Dealer'] == 'MA0143'].sort_values(by='Month', ascending=False)
MA0143_2.set_index('Dealer', inplace=True)
display(MA0143_2)

MA0143_3 = df3.loc[df3['Dealer'] == 'MA0143'].sort_values(by='Month', ascending=False)
MA0143_3.set_index('Dealer', inplace=True)
display(MA0143_3)

MA0143_4 = df4.loc[df4['Dealer'] == 'MA0143'].sort_values(by='Email_month', ascending=False)
MA0143_4.set_index('Dealer', inplace=True)
display(MA0143_4)

        Year  Month  Total Sales
Dealer
MA0143  2019     12          191
MA0143  2019     11          170
MA0143  2019     10          170

Empty DataFrame
Columns: [Month, Year, Year Month, Conquest Sales]
Index: []

        Month  Year Year Month TransactionType  Loyalty & Service Sales
Dealer
MA0143     12  2019 2019-12-01     aM Campaign                       56
MA0143     12  2019 2019-12-01       aM Direct                       13
MA0143     12  2019 2019-12-01       sM Direct                       10
MA0143     12  2019 2019-12-01     sM Campaign                        9
MA0143     11  2019 2019-11-01     aM Campaign                       49
MA0143     11  2019 2019-11-01       aM Direct                       18
MA0143     11  2019 2019-11-01       sM Direct                        4
MA0143     11  2019 2019-11-01     sM Campaign                        2
MA0143     10  2019 2019-10-01     aM Campaign                       65
MA0143     10  2019 2019-10-01       aM Direct                       16
MA0143     10  2019 2019-10-01     sM Campaign                        6
MA0143     10  2019 2019-10-01       sM Direct                        5

        Email_month  Email_Year Full  Sent  Delivered  Delivery %
Dealer
MA0143           12             2019  4498       4236    0.941752
MA0143           11             2019  4471       4202    0.939834
MA0143           10             2019  4249       4145    0.975524

### Aggregate results for CB0122

In [15]:
CB0122_1 = df1.loc[df1['Dealer'] == 'CB0122'].sort_values(by='Month', ascending=False)
CB0122_1.set_index('Dealer', inplace=True)
display(CB0122_1)

CB0122_2 = df2.loc[df2['Dealer'] == 'CB0122'].sort_values(by='Month', ascending=False)
CB0122_2.set_index('Dealer', inplace=True)
display(CB0122_2)

CB0122_3 = df3.loc[df3['Dealer'] == 'CB0122'].sort_values(by='Month', ascending=False)
CB0122_3.set_index('Dealer', inplace=True)
display(CB0122_3)

CB0122_4 = df4.loc[df4['Dealer'] == 'CB0122'].sort_values(by='Email_month', ascending=False)
CB0122_4.set_index('Dealer', inplace=True)
display(CB0122_4)

        Year  Month  Total Sales
Dealer
CB0122  2019     12          367
CB0122  2019     11          375
CB0122  2019     10          380

        Month  Year  Year Month  Conquest Sales
Dealer
CB0122     12  2019       43800              28
CB0122     11  2019       43770              20
CB0122     10  2019       43739              14

        Month  Year Year Month TransactionType  Loyalty & Service Sales
Dealer
CB0122     12  2019 2019-12-01     aM Campaign                       56
CB0122     12  2019 2019-12-01     sM Campaign                        7
CB0122     12  2019 2019-12-01       sM Direct                        4
CB0122     12  2019 2019-12-01       aM Direct                        3
CB0122     11  2019 2019-11-01     aM Campaign                       52
CB0122     11  2019 2019-11-01       aM Direct                        6
CB0122     11  2019 2019-11-01     sM Campaign                        5
CB0122     11  2019 2019-11-01       sM Direct                        2
CB0122     10  2019 2019-10-01     aM Campaign                       67
CB0122     10  2019 2019-10-01       aM Direct                        5
CB0122     10  2019 2019-10-01     sM Campaign                        2

        Email_month  Email_Year Full  Sent  Delivered  Delivery %
Dealer
CB0122           12             2019  6913       6369    0.921308
CB0122           11             2019  6500       6014    0.925231
CB0122           10             2019  6794       6513    0.958640

## Q2 - For the three dealers specified above, computer the following:

In [16]:
select_dealer = ['TA0131', 'MA0143', 'CB0122']

### a) Total dealership sales volume

In [17]:
# Total dealership sales sub-df
select_df1 = [TA0131_1, MA0143_1, CB0122_1]

total_sales = []
for df1 in select_df1:
                                          # find each dealer's
    total_sale = df1['Total Sales'].sum() # total sales in 3-month period
    total_sales.append(total_sale)

total_sales

[2573, 531, 1122]

In [18]:
# Create a dictionary to combine dealerID with total sales
dealer_total_sales = dict(zip(select_dealer, total_sales))
dealer_total_sales

{'TA0131': 2573, 'MA0143': 531, 'CB0122': 1122}

In [19]:
for key, value in dealer_total_sales.items():
    print("Total dealership sales volume by {} is {}. \n".format(key, value))
                                                                   
print("All three selected dealers' total dealership sales volume is {}.".format(sum(total_sales)))

Total dealership sales volume by TA0131 is 2573.

Total dealership sales volume by MA0143 is 531.

Total dealership sales volume by CB0122 is 1122.

All three selected dealers' total dealership sales volume is 4226.

### b) Average monthly total dealership sales volume for the three-month period, in total and by dealer

In [20]:
avg_sales = []
for df in select_df1:
                                            # find each dealer's
    average_sale = df['Total Sales'].mean() # average of total sales for 3-month period
    avg_sales.append(round(average_sale, 2))

dealer_avg_sales = dict(zip(select_dealer, avg_sales))

for key, value in dealer_avg_sales.items():
    print("Average monthly total dealership sales volume for 3-month period by {} is {}. \n"\
          .format(key, value))

print("All three selected dealers' average monthly dealership sales volume for 3-month period is {}."\
      .format(round(sum(avg_sales), 2)))

Average monthly total dealership sales volume for 3-month period by TA0131 is 857.67.

Average monthly total dealership sales volume for 3-month period by MA0143 is 177.0.

Average monthly total dealership sales volume for 3-month period by CB0122 is 374.0.

All three selected dealers' average monthly dealership sales volume for 3-month period is 1408.67.

### c) Attributable volume, in total and by loyalty/service vs. conquest, in total and by dealer

In [21]:
# Conquest sub-df
select_df2 = [TA0131_2, MA0143_2, CB0122_2]

# Loyal/service sub-df
select_df3 = [TA0131_3, MA0143_3, CB0122_3]

In [22]:
total_conquest = []
for df2 in select_df2:
                                                      # for each dealer's
    total_conquest_sale = df2['Conquest Sales'].sum() # total conquest sale in 3-month period
    total_conquest.append(total_conquest_sale)

total_conquest_sales = dict(zip(select_dealer, total_conquest))

for key, value in total_conquest_sales.items():
    print("Attributable volume by conquest sales by {} is {}. \n".format(key, value))

print("All three selected dealers' attributable volume by conquest sales is {}.".format(sum(total_conquest)))

Attributable volume by conquest sales by TA0131 is 59.

Attributable volume by conquest sales by MA0143 is 0.

Attributable volume by conquest sales by CB0122 is 62.

All three selected dealers' attributable volume by conquest sales is 121.

In [23]:
total_loyal = []
for df3 in select_df3:
                                                                    # for each dealer's
    total_loyal_service_sale = df3['Loyalty & Service Sales'].sum() # total loyal/service sale in 3-month period
    total_loyal.append(total_loyal_service_sale)

total_loyal_sales = dict(zip(select_dealer, total_loyal))

for key, value in total_loyal_sales.items():
    print("Attributable volume by loyal/service sales by {} is {}. \n".format(key, value))
    
print("All three selected dealers' attributable volume by loyal/service sale is {}.".format(sum(total_loyal)))

Attributable volume by loyal/service sales by TA0131 is 526.

Attributable volume by loyal/service sales by MA0143 is 253.

Attributable volume by loyal/service sales by CB0122 is 209.

All three selected dealers' attributable volume by loyal/service sale is 988.

In [24]:
# Total attribute sale = conquest sale and loyal/service sale
attribute = zip(total_conquest, total_loyal)
total_attribute = [x + y for x, y in attribute]

total_attribute_sales = dict(zip(select_dealer, total_attribute))

for key, value in total_attribute_sales.items():
    print("Total attribute volume by conquest sales and loyal/service sales by {} is {}. \n".format(key, value))

print("All three selected dealers' total attribute volume by conquest sales and loyal/service sales is {}."\
      .format(sum(total_attribute)))

Total attribute volume by conquest sales and loyal/service sales by TA0131 is 585.

Total attribute volume by conquest sales and loyal/service sales by MA0143 is 253.

Total attribute volume by conquest sales and loyal/service sales by CB0122 is 271.

All three selected dealers' total attribute volume by conquest sales and loyal/service sales is 1109.

### d) Average monthly attributable volume for the three-month period, in total and by dealer

In [25]:
avg_attribute = []
for number in total_attribute:
                                             # for each dealer's
    avg_attribute.append(round(number/3, 2)) # average total attribute sale for 3-month period

avg_attribute_sales = dict(zip(select_dealer, avg_attribute))

for key, value in avg_attribute_sales.items():
    print("Average monthly attribute volume for 3-month period by {} is {}. \n".format(key, value))

print("All selected dealers' average monthly attribute volume for 3-month period is {}."\
      .format(round(sum(avg_attribute), 2)))

Average monthly attribute volume for 3-month period by TA0131 is 195.0.

Average monthly attribute volume for 3-month period by MA0143 is 84.33.

Average monthly attribute volume for 3-month period by CB0122 is 90.33.

All selected dealers' average monthly attribute volume for 3-month period is 369.66.

### e) Average email delivery rate for the three-month period, in total and by dealer

In [26]:
# Email sub-df
select_df4 = [TA0131_4, MA0143_4, CB0122_4]

avg_email = []
for df4 in select_df4:
                                                  # for each dealer's
    avg_email_delivery = df4['Delivery %'].mean() # average of email delivery rate for 3-month period
    avg_email.append(round(avg_email_delivery, 4))

dealer_email = dict(zip(select_dealer, avg_email))

for key, value in dealer_email.items():
    print("Average email delivery rate for 3-month period by {} is {}. \n".format(key, value))

print("All three selected dealers' average email delivery rate for 3-month period is {}."\
      .format(round(sum(avg_email), 4)))

Average email delivery rate for 3-month period by TA0131 is 0.9413.

Average email delivery rate for 3-month period by MA0143 is 0.9524.

Average email delivery rate for 3-month period by CB0122 is 0.9351.

All three selected dealers' average email delivery rate for 3-month period is 2.8288.

## Q3 - Of the same three dealers, which dealer carries the highest volume of attributable sales for the period?

In [27]:
print(total_attribute_sales, "\n")

# Find the key with the max value in dictionary
max_volume = max(total_attribute_sales, key=total_attribute_sales.get)

print("{} carries the highest volume of attribute sales.".format(max_volume))

{'TA0131': 585, 'MA0143': 253, 'CB0122': 271}

TA0131 carries the highest volume of attribute sales.

## Q4 - Of the same three dealers, which dealer carries the highest ratio of attributable sales (total attributable sales) for the period?
- ratio = attribute sales / total sales

In [28]:
print("Attribute sales: ", total_attribute, "\n")
print("Total sales: ", total_sales)

Attribute sales:  [585, 253, 271]

Total sales:  [2573, 531, 1122]

In [29]:
# ratio = attribute sale / total sale
r = [i/j for i, j in zip(total_attribute, total_sales)]

# round r with 4 decimal place
r = [round(num, 4) for num in r]

ratio = dict(zip(select_dealer, r))
print(ratio, "\n")

max_ratio = max(ratio, key=ratio.get)

print("{} carries the highest ratio of attribute sales.".format(max_ratio))

{'TA0131': 0.2274, 'MA0143': 0.4765, 'CB0122': 0.2415}

MA0143 carries the highest ratio of attribute sales.

## Q5 - Of the same three dealers, which dealer exhibited the greatest change in attributable sales between November and December?
- Expect to find the difference between Nov and Dec
- Bigger difference -> greater change

In [30]:
# Conquest sales difference between November and December
conq_diff = []

for df2 in select_df2:
    conq_list = df2['Conquest Sales'].tolist()
    
    if bool(conq_list) == True:
        diff = conq_list[0] - conq_list[1] # Select dataframe is sorted by month in a descending order
                                           # December -> November -> October
                                           # As a result, when the values are put in a list, it follows the order                               
        conq_diff.append(diff)
    
    # Since MA0143 has no attributale sale by conquest, the corresponding list will be empty
    # Empy list can not perform any algebraic operation -> just append 0 for the difference
    else:
        conq_diff.append(0)

conq_diff

[7, 0, 8]

In [31]:
# Loyal sales difference between November and December
loyal_diff = []

for df3 in select_df3:
    
    # Create a new sub-df by group the month together and find the sum of loyal sale for that month
    new_df3 = df3.groupby('Month')['Loyalty & Service Sales'].agg(['sum']).sort_index(ascending=False)
    
    # Preview
    display(new_df3)
    
    loyal_list = new_df3['sum'].tolist()
    loyal_diff.append(loyal_list[0] - loyal_list[1])

loyal_diff

       sum
Month
12     195
11     161
10     170

       sum
Month
12      88
11      73
10      92

       sum
Month
12      70
11      65
10      74

[34, 15, 5]

In [32]:
# Attribute diff = Conquest diff + Loyal diff
attribute_diff = [x + y for x, y in zip(conq_diff, loyal_diff)]
attribute_diff

[41, 15, 13]

In [33]:
attribute_change = dict(zip(select_dealer, attribute_diff))
print(attribute_change, "\n")

max_change = max(attribute_change, key=attribute_change.get)

print("{} exhibited the greatest change in attributable sales between November and December.".format(max_change))

{'TA0131': 41, 'MA0143': 15, 'CB0122': 13}

TA0131 exhibited the greatest change in attributable sales between November and December.